const minus = require('./minus');
// 11 - 2 เท่ากับ 9
test('11 + 2 เท่ากับ 9', ()=> {
  expect(minus(11,2)).toBe(9);
});

// 20 - 1 เท่ากับ 19
test('20 - 1 เท่ากับ 19',()=>{
  expect(minus(20,1)).toBe(19);
})

// 12 - 5 เท่ากับ 7
test('12 - 5 เท่ากับ 7',()=> {
  expect(minus(12,5)).toBe(7);
})

// 14 - 5 เท่ากับ 9
test('14 - 5 เท่ากับ 9',()=> {
  expect(minus(14,5)).toBe(9);
})

// 15 - 2 เท่ากับ 13
test('15 - 2 เท่ากับ 13',()=> {
  expect(minus(15,2)).toBe(13);
})

// 18 - 10 เท่ากับ 8
test('18 - 10 เท่ากับ 8',()=> {
  expect(minus(18,10)).toBe(8);
})
